---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyleOverrideOptions.HorizontalAlignment
source: html/b478b390-df85-32b7-ae66-c312d3bd3a77.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.HorizontalAlignment Property

Indicates if the horizontal alignment characteristic is overridden.

## Syntax (C#)
```csharp
public bool HorizontalAlignment { get; set; }
```